const bannerData = [
    {
        image: 'images/main-slider/image-1.jpg',
        title: 'وكالتك الإبداعية للانطلاق نحو القمة <br> في عالم التسويق الرقمي',
        text: 'نقدم لك إدارة احترافية شاملة لحسابات السوشيال ميديا، نصمم محتوى إبداعي جذاب، ونطلق حملات إعلانية مدروسة بدقة لتحقيق أقصى انتشار وبناء ولاء جمهورك',
        link: 'about.html',
        linkText: 'المزيد'
    },
    {
        image: 'images/main-slider/image-2.jpg',
        title: 'حلول تسويقية <br> متكاملة لزيادة انتشارك وأرباحك',
        text: 'من أول فكرة إلى خطة تسويقية متكاملة وتنفيذ إبداعي، نحن شريكك الاستراتيجي للنمو، نحرص على تميز علامتك التجارية وتحقيق نتائج ملموسة في السوق',
        link: 'about.html',
        linkText: 'المزيد'
    },
    {
        image: 'images/main-slider/image-3.jpeg',
        title: 'حوّل أفكارك <br> إلى علامة تجارية ناجحة تُحدث فرقًا',
        text: 'فريقنا من خبراء التسويق الرقمي يعمل على صناعة محتوى متجدد ومؤثر، مدعوم بتحليلات دقيقة لضمان أن تصل رسالتك إلى جمهورك المستهدف في الوقت المناسب وبالأسلوب الأمثل',
        link: 'about.html',
        linkText: 'المزيد'
    },
];
export default bannerData;
