function generateSlug(title) {
    return encodeURIComponent(title.trim().replace(/\s+/g, "-"));
}

const postsData = [
    {
        image: "images/resource/news-1.jpg",
        title: "استراتيجيات تسويق رقمي ترفع مبيعاتك",
        category: "التسويق الإلكتروني",
        time: "منذ 3 ساعات",
        content: `
            في عالم اليوم الرقمي، أصبح التسويق الإلكتروني هو المحرك الأساسي لزيادة المبيعات النجاح في التسويق يبدأ بفهم جمهورك المستهدف باستخدام استراتيجيات مثل تحسين محركات البحث، التسويق عبر وسائل التواصل الاجتماعي
        `
    },
    {
        image: "images/resource/news-2.jpg",
        title: "كيف تزيد من تفاعل العملاء مع علامتك التجارية",
        category: "البراندينج",
        time: "منذ 5 ساعات",
        content: `
            في عالم اليوم الرقمي، أصبح التسويق الإلكتروني هو المحرك الأساسي لزيادة المبيعات النجاح في التسويق يبدأ بفهم جمهورك المستهدف باستخدام استراتيجيات مثل تحسين محركات البحث، التسويق عبر وسائل التواصل الاجتماعي
        `
    },
    {
        image: "images/resource/news-3.jpg",
        title: "أهمية الإعلانات الممولة في نمو مشروعك",
        category: "إعلانات ممولة",
        time: "منذ يوم واحد",
        content: `
            في عالم اليوم الرقمي، أصبح التسويق الإلكتروني هو المحرك الأساسي لزيادة المبيعات النجاح في التسويق يبدأ بفهم جمهورك المستهدف باستخدام استراتيجيات مثل تحسين محركات البحث، التسويق عبر وسائل التواصل الاجتماعي
        `
    },
    {
        image: "images/resource/news-4.jpg",
        title: "كتابة محتوى يجذب ويحوّل الزوار إلى عملاء",
        category: "كتابة المحتوى",
        time: "منذ 6 ساعات",
        content: `
            في عالم اليوم الرقمي، أصبح التسويق الإلكتروني هو المحرك الأساسي لزيادة المبيعات النجاح في التسويق يبدأ بفهم جمهورك المستهدف باستخدام استراتيجيات مثل تحسين محركات البحث، التسويق عبر وسائل التواصل الاجتماعي
        `
    },
    {
        image: "images/resource/news-5.jpg",
        title: "تحليل الأداء سر تحسين حملاتك الإعلانية",
        category: "تحليل البيانات",
        time: "منذ ساعتين",
        content: `
            في عالم اليوم الرقمي، أصبح التسويق الإلكتروني هو المحرك الأساسي لزيادة المبيعات النجاح في التسويق يبدأ بفهم جمهورك المستهدف باستخدام استراتيجيات مثل تحسين محركات البحث، التسويق عبر وسائل التواصل الاجتماعي
        `
    },
    {
        image: "images/resource/news-6.jpg",
        title: "تصميم جرافيك احترافي يعكس هوية شركتك",
        category: "تصميم جرافيك",
        time: "منذ 4 ساعات",
        content: `
            في عالم اليوم الرقمي، أصبح التسويق الإلكتروني هو المحرك الأساسي لزيادة المبيعات النجاح في التسويق يبدأ بفهم جمهورك المستهدف باستخدام استراتيجيات مثل تحسين محركات البحث، التسويق عبر وسائل التواصل الاجتماعي
        `
    }
];

// إضافة slug تلقائي لكل بوست
postsData.forEach(post => {
    post.slug = generateSlug(post.title);
});

export default postsData;
